# Create Method (Connector, ElectricalSystemType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..Create Method (Connector, ElectricalSystemType)
ElectricalSystem Class See Also
---
Creates a new MEP Electrical System element from an unused Connector.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static ElectricalSystem Create(
	Connector connector,
	ElectricalSystemType elecSysType
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	connector As Connector, _
	elecSysType As ElectricalSystemType _
) As ElectricalSystem
```

Visual C++
---
```text
public:
static ElectricalSystem^ Create(
	Connector^ connector,
	ElectricalSystemType elecSysType
)
```

# ### Parameters
connector
    Type: Autodesk.Revit.DB..::..Connector The Connector to create this Electrical System.
elecSysType
    Type: Autodesk.Revit.DB.Electrical..::..ElectricalSystemType The System Type of electrical system.
# ### Return Value
If successful a new MEP Electrical System element within the project, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
ElectricalSystem Class
Create Overload
Autodesk.Revit.DB.Electrical Namespace